HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEth_reg.h
/** \\brief  1074, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G06_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E074u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G06_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G06_LOW.
*/
#define	ETH_MAC_ADDRESS6_LOW	(ETH_MAC_ADDRESS_G06_LOW)

/** \\brief  1078, MAC Address High Register */
#define ETH_MAC_ADDRESS_G07_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E078u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_HIGH.
*/
#define	ETH_MAC_ADDRESS7_HIGH	(ETH_MAC_ADDRESS_G07_HIGH)

/** \\brief  107C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G07_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E07Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_LOW.
*/
#define	ETH_MAC_ADDRESS7_LOW	(ETH_MAC_ADDRESS_G07_LOW)

/** \\brief  1080, MAC Address High Register */
#define ETH_MAC_ADDRESS_G08_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E080u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_HIGH.
*/
#define	ETH_MAC_ADDRESS8_HIGH	(ETH_MAC_ADDRESS_G08_HIGH)

/** \\brief  1084, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G08_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E084u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_LOW.
*/
#define	ETH_MAC_ADDRESS8_LOW	(ETH_MAC_ADDRESS_G08_LOW)

/** \\brief  1088, MAC Address High Register */
#define ETH_MAC_ADDRESS_G09_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E088u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_HIGH.
*/
#define	ETH_MAC_ADDRESS9_HIGH	(ETH_MAC_ADDRESS_G09_HIGH)

/** \\brief  108C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G09_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E08Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_LOW.
*/
#define	ETH_MAC_ADDRESS9_LOW	(ETH_MAC_ADDRESS_G09_LOW)

/** \\brief  1800, MAC Address High Register */
#define ETH_MAC_ADDRESS_G10_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E800u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_HIGH.
*/
#define	ETH_MAC_ADDRESS16_HIGH	(ETH_MAC_ADDRESS_G10_HIGH)

/** \\brief  1804, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G10_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E804u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_LOW.
*/
#define	ETH_MAC_ADDRESS16_LOW	(ETH_MAC_ADDRESS_G10_LOW)

/** \\brief  1850, MAC Address High Register */
#define ETH_MAC_ADDRESS_G110_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E850u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_HIGH.
*/
#define	ETH_MAC_ADDRESS26_HIGH	(ETH_MAC_ADDRESS_G110_HIGH)

/** \\brief  1854, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G110_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E854u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_LOW.
*/
#define	ETH_MAC_ADDRESS26_LOW	(ETH_MAC_ADDRESS_G110_LOW)

/** \\brief  1858, MAC Address High Register */
#define ETH_MAC_ADDRESS_G111_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E858u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_HIGH.
*/
#define	ETH_MAC_ADDRESS27_HIGH	(ETH_MAC_ADDRESS_G111_HIGH)

/** \\brief  185C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G111_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E85Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_LOW.
*/
#define	ETH_MAC_ADDRESS27_LOW	(ETH_MAC_ADDRESS_G111_LOW)

/** \\brief  1860, MAC Address High Register */
#define ETH_MAC_ADDRESS_G112_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E860u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_HIGH.
*/
#define	ETH_MAC_ADDRESS28_HIGH	(ETH_MAC_ADDRESS_G112_HIGH)

/** \\brief  1864, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G112_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E864u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_LOW.
*/
#define	ETH_MAC_ADDRESS28_LOW	(ETH_MAC_ADDRESS_G112_LOW)

/** \\brief  1868, MAC Address High Register */
#define ETH_MAC_ADDRESS_G113_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E868u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_HIGH.
*/
#define	ETH_MAC_ADDRESS29_HIGH	(ETH_MAC_ADDRESS_G113_HIGH)

/** \\brief  186C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G113_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E86Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_LOW.
*/
#define	ETH_MAC_ADDRESS29_LOW	(ETH_MAC_ADDRESS_G113_LOW)

/** \\brief  1870, MAC Address High Register */
#define ETH_MAC_ADDRESS_G114_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E870u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_HIGH.
*/
#define	ETH_MAC_ADDRESS30_HIGH	(ETH_MAC_ADDRESS_G114_HIGH)

